layer {
  name: "input"
  type: "Input"
  top: "data"
  input_param {
    # These dimensions are purely for sake of example;
    # see infer.py for how to reshape the net to the given input size.
    shape { dim: 1 dim: 3 dim: 500 dim: 500 }
  }
}
layer{
  name:"interp"
  type:"Interp"
  bottom:"data"
  top:"interp"
  interp_param{
      shrink_factor:2
      zoom_factor:2
      pad_beg:0
      pad_end:0
  }

}


A
A
A
A
A
A
A
A
A
A
A
A
A
A
A
A
A
A
A
A
A
A

